world_champions = {
    2002: 'Бразилия',
    2006: 'Италия',
    2010: 'Испания',
    2014: 'Германия',
    2018: 'Франция',
}

world_champions[2022] = 'Аргентина' #добавили в словарь

for key, value in world_champions.items():
    print(key, '-', value) #вывели на экран в требуемом формате

country = 'Италия'

if country in world_champions.values(): #определяем, была ли Италия чемпионом в 21 веке
    print('Италия cтановилась чемпионом мира по футболу в 21 веке!')
else:
    print('Италия не выигрывала чемпионат мира по футболу в 21 веке.')